tap "databricks/tap"
tap "deviceinsight/packages"
tap "github/gh"
tap "homebrew/cask"
tap "homebrew/core"
tap "kitlangton/tap"
tap "mongodb/brew"
tap "virtuslab/scala-cli"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose", link: false
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Test automation tool that supports executable documentation
brew "gauge"
# GNU multiple precision arithmetic library
brew "gmp"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# CLI for managing Apache Kafka
brew "kafkactl"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Fast and flexible C++ library for working with OpenStreetMap data
brew "libosmium"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Convert bitmaps to vector graphics
brew "potrace"
# Run a query in psql and output the result as CSV
brew "psql2csv"
# Generic machine emulator and virtualizer
brew "qemu"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Build tool for Scala projects
brew "sbt"
# Secure Reliable Transport
brew "srt"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line utility for Structurizr
brew "structurizr-cli"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Update your Scala dependencies interactively
brew "kitlangton/tap/scala-update"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Launcher for ScalaCli
brew "virtuslab/scala-cli/scala-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-maple-mono"
cask "font-maple-mono-nf"
# Web browser
cask "google-chrome"
# Dedicated scratchpad for developers
cask "heynote"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Unpacks archive files
cask "the-unarchiver"
# Rust-based terminal
cask "warp"
# Web browser
cask "wavebox"
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Maccy", id: 1527619437
mas "Peek", id: 1554235898
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
