tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "versent/taps"
# Ammonite is a cleanroom re-implementation of the Scala REPL
brew "ammonite-repl"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Test automation tool that supports executable documentation
brew "gauge"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast and flexible C++ library for working with OpenStreetMap data
brew "libosmium"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Python dependency management tool
brew "pipenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Build tool for Scala projects
brew "sbt"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Reimagine your terminal
cask "fig"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java8"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
cask "qlvideo"
cask "remembear"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Multimedia player
cask "vlc"
# Web browser
cask "wavebox"
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
